Revit 2026 API

# ControlledApplicationVersionName Property

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string VersionName { get; }
```
```vb
Public ReadOnly Property VersionName As String
	Get
```
```cpp
public:
property String^ VersionName {
	String^ get ();
}
```
```fsharp
member VersionName : string with get
```

#### Property Value

String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace